/* 班级 学号 姓名 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量（全局只读变量或宏定义不受此限制）
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：函数中的...替换为相应内容
***************************************************************************/
//此处允许添加相关内容
void output(..., const char* prompt)  //将...替换为相应内容（允许出现[]）
{
	... *p;  //本函数只允许定义这一个指针变量，不再允许定义任何形式的变量

	/* 输出提示信息 */
	...

	/* 输出整个数组，不允许任何形式的[]出现 */
	...
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：函数中的...替换为相应内容
***************************************************************************/
//此处允许添加相关内容
int merge(...)//将...替换为相应内容（允许出现[]）
{
	/* 变量定义的数量不限（建议三个指针变量，足矣） */

	/* 整个程序的实现不允许出现任何[] */
	
	return ...; //return的值是合并后的元素个数
}

/* -- 替换标记行 -- 本行不要做任何改动 -- 本行不要删除 -- 在本行的下面不要加入任何自己的语句，作业提交后从本行开始会被替换 -- 替换标记行 -- */

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main(int argc, char** argv)
{
	/* 以下测试为int型 */
	if (1) {
		int a[10] = {19,17,15,13,11,9,7,5,3,1}; //人为保证降序
		int b[5] = {18,17,12,11,5};//人为保证降序
		int c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 19 18 17 15 13 12 11 9 7 5 3 1" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i=0; i<num; i++)
			cout << *(c+i) << ' ';
		cout << endl << endl;
	}

	if (1) {
		int a[10] = { 19,17,15,13,11,9,7,5,3,1 }; //人为保证降序
		int b[5] = { 17,13,9,5,1 };//人为保证降序
		int c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 19 17 15 13 11 9 7 5 3 1" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';
		cout << endl << endl;
	}

	if (1) {
		int a[10] = { 19,17,15,13,11,9,7,5,3,1 }; //人为保证降序
		int b[5] = { 20,18,10,0, -3 };//人为保证降序
		int c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 20 19 18 17 15 13 11 10 9 7 5 3 1 0 -3" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';//期望输出  共15个数
		cout << endl << endl;
	}

	if (1) {
		int a[10] = { 19,17,15,15,11,9,9,3,3,3 }; //人为保证降序
		int b[5] = { 20,17,10,10, 5 };//人为保证降序
		int c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 20 19 17 15 11 10 9 5 3" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';//期望输出  共15个数
		cout << endl << endl;
	}

	/* 以下测试为double型 */
	if (1) {
		double a[10] = { 19,17,15,13,11,9,7,5,3,1 }; //人为保证降序
		double b[5] = { 18,17,12,11,5 };//人为保证降序
		double c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 19 18 17 15 13 12 11 9 7 5 3 1" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' '; //期望输出 19 18 17 15 13 12 11 9 7 5 3 1 共12个数
		cout << endl << endl;
	}

	if (1) {
		double a[10] = { 19,17,15,13,11,9,7,5,3,1 }; //人为保证降序
		double b[5] = { 17,13,9,5,1 };//人为保证降序
		double c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 19 17 15 13 11 9 7 5 3 1" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';//期望输出 19 17 15 13 11 9 7 5 3 1 共10个数
		cout << endl << endl;
	}

	if (1) {
		double a[10] = { 19,17,15,13,11,9,7,5,3,1 }; //人为保证降序
		double b[5] = { 20,18,10,0, -3 };//人为保证降序
		double c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 20 19 18 17 15 13 11 10 9 7 5 3 1 0 -3" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';//期望输出 20 19 18 17 15 13 11 10 9 7 5 3 1 0 -3 共15个数
		cout << endl << endl;
	}

	if (1) {
		int a[10] = { 19,17,15,15,11,9,9,3,3,3 }; //人为保证降序
		int b[5] = { 20,17,10,10, 5 };//人为保证降序
		int c[15];

		output(a, "合并前数组1的内容为 : ");
		output(b, "合并前数组2的内容为 : ");
		int num = merge(a, b, c);

		cout << "          期望输出  : 20 19 17 15 11 10 9 5 3" << endl;
		cout << "合并后数组的内容为  : ";
		for (int i = 0; i < num; i++)
			cout << *(c + i) << ' ';//期望输出  共15个数
		cout << endl << endl;
	}

	return 0;
}
